-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2024-01-11 14:08:01
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `camping_gear`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `my_table`
--

CREATE TABLE `my_table` (
  `id` int(11) NOT NULL,
  `item` varchar(128) NOT NULL,
  `category` varchar(128) NOT NULL,
  `genre` varchar(128) NOT NULL,
  `maker` varchar(128) NOT NULL,
  `purchase_date` date NOT NULL,
  `price` int(11) NOT NULL,
  `long_side` decimal(5,1) NOT NULL,
  `short_side` decimal(5,1) NOT NULL,
  `thickness` decimal(5,1) NOT NULL,
  `weight` int(5) NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `my_table`
--

INSERT INTO `my_table` (`id`, `item`, `category`, `genre`, `maker`, `purchase_date`, `price`, `long_side`, `short_side`, `thickness`, `weight`, `created_at`, `updated_at`) VALUES
(1, 'ポケットEZシェード', 'タープ・シェード', 'シェード', 'コールマン', '2022-10-01', 4800, 38.0, 6.0, 13.0, 1400, '2023-12-19 06:28:13', '2023-12-19 06:28:13'),
(2, 'ファイヤーディスク(TM)ソロ', 'グリル・焚火', '焚火台', 'コールマン', '2022-12-01', 5390, 32.0, 32.0, 10.0, 900, '2023-12-19 06:31:57', '2023-12-19 06:31:57'),
(3, 'ミニ焚火台テトラ', 'グリル・焚火', '焚火台', 'SOTO', '2022-11-01', 1320, 8.8, 8.0, 0.4, 122, '2023-12-19 06:34:06', '2023-12-19 06:34:06'),
(4, '耐熱アルミテーブル', '家具', 'テーブル', 'ワークマン', '2023-01-15', 980, 21.4, 12.1, 2.7, 390, '2023-12-19 06:37:10', '2023-12-19 06:37:10'),
(5, 'ポータブルチェア　ポリコットン　ノーマル', '家具', 'チェア', 'フィールドア', '2023-02-01', 4200, 38.0, 11.0, 13.0, 1000, '2023-12-19 06:40:21', '2023-12-19 06:40:21'),
(6, 'ファミリー2in1　C10', '寝具', '寝袋', 'コールマン', '2023-03-01', 8500, 42.0, 30.0, 30.0, 3000, '2023-12-19 06:43:03', '2023-12-19 06:43:03'),
(7, 'クロスポールドーム240', 'テント', 'テント', 'フィールドア', '2022-09-01', 6710, 54.0, 20.0, 20.0, 3200, '2023-12-19 06:45:24', '2023-12-19 06:45:24'),
(8, 'スクエアタープ', 'タープ・シェード', 'タープ', 'フィールドア', '2022-10-01', 3740, 25.0, 14.0, 14.0, 1300, '2023-12-19 06:48:28', '2023-12-19 06:48:28'),
(9, 'アルミテントポール150　2セット入り', '小物類', 'ポール', 'フィールドア', '2022-10-01', 3300, 37.0, 11.0, 11.0, 500, '2023-12-19 06:51:00', '2023-12-19 06:51:00'),
(10, 'ジョイントバックパック　スタンダード', 'バッグ類', 'リュック', 'ワークマン', '2022-08-01', 3900, 56.0, 32.0, 9.0, 600, '2023-12-19 20:40:23', '2023-12-19 20:40:23'),
(11, 'アルミペグハンマー', '小物類', 'ハンマー', 'クイックキャンプ', '2022-11-01', 2000, 31.0, 11.0, 3.0, 350, '2023-12-19 20:43:43', '2023-12-19 20:43:43'),
(12, '鋳造ペグ　8本セット', '小物類', 'ペグ', 'クイックキャンプ', '2022-11-01', 1800, 20.0, 20.0, 10.0, 440, '2023-12-19 20:45:45', '2023-12-19 20:45:45'),
(13, '2WAY エアクッション 5cm厚', '小物類', 'クッション', 'クイックキャンプ', '2022-12-01', 2000, 30.0, 5.0, 5.0, 300, '2023-12-19 20:48:05', '2023-12-19 20:48:05'),
(14, '7075ポケットスツール', '家具', 'スツール', 'ロゴス', '2023-02-01', 2980, 26.0, 12.0, 5.5, 340, '2023-12-19 20:50:57', '2023-12-19 20:50:57'),
(15, '氷点下パック・クールキーパー', '保冷グッズ', 'クーラーボックス', 'ロゴス', '2022-09-01', 3700, 23.5, 17.5, 17.0, 500, '2023-12-19 20:54:28', '2023-12-19 20:54:28'),
(16, '倍速凍結・氷点下パックM', '保冷グッズ', '保冷剤', 'ロゴス', '2022-09-01', 1280, 19.6, 13.8, 2.6, 600, '2023-12-19 20:57:46', '2023-12-19 20:57:46'),
(17, 'スマイルLEDランタン', '電化製品', 'ランタン', 'SPICEofLife', '2022-08-01', 1320, 17.0, 11.0, 11.0, 150, '2023-12-19 21:00:34', '2023-12-19 21:00:34'),
(18, 'CARRY THE SUN　Small', '電化製品', 'ランタン', 'ランドポート', '2022-09-01', 3190, 17.0, 8.8, 1.2, 57, '2023-12-19 21:11:39', '2023-12-19 21:11:39'),
(19, 'ソフトくらこ（１０）', '保冷グッズ', 'クーラーボックス', 'DOD', '2022-11-01', 5040, 41.0, 29.0, 13.0, 700, '2023-12-19 21:14:21', '2023-12-19 21:14:21'),
(20, 'カマボコリュック', 'バッグ類', 'リュック', 'DOD', '2022-12-01', 7700, 49.0, 30.0, 16.0, 700, '2023-12-19 21:17:01', '2023-12-19 21:17:01'),
(21, 'キングトング', '小物類', 'トング', 'テンマクデザイン', '2023-08-01', 1408, 39.5, 3.7, 2.2, 157, '2023-12-20 21:52:37', '2023-12-20 21:52:37'),
(22, 'ポケットストーブ', 'グリル・焚火', 'ポケットストーブ', 'ダイソー', '2022-11-01', 330, 10.0, 7.2, 2.2, 102, '2023-12-21 22:57:08', '2023-12-21 22:57:08'),
(23, '焚火用グローブ　ロング', 'グリル・焚火', 'グローブ', '不明', '2023-12-22', 2000, 35.0, 14.0, 2.0, 337, '2023-12-22 00:01:03', '2023-12-22 00:01:03'),
(24, '軍手', '小物類', '軍手', 'ワークマン', '2023-12-23', 2000, 25.0, 20.0, 1.1, 200, '2023-12-23 13:18:14', '2023-12-23 13:18:14'),
(26, '焚火シート', 'グリル・焚火', '小物', 'フューチャーフォックス', '2023-12-23', 3500, 80.0, 80.0, 1.5, 400, '2024-01-04 18:37:03', '2024-01-04 18:37:03'),
(33, 'hoge', 'hoge', 'hoge', 'hoge', '2024-01-11', 1500, 10.0, 10.0, 1.0, 300, '2024-01-11 21:36:37', '2024-01-11 21:36:37'),
(34, 'fuga', 'fuga', 'fuga', 'fuga', '2024-01-11', 3000, 30.0, 30.0, 5.0, 400, '2024-01-11 21:37:11', '2024-01-11 21:37:11');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `my_table`
--
ALTER TABLE `my_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `my_table`
--
ALTER TABLE `my_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
